README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-12-23 Mon 15:30 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>CV and my github webpage</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="ChongChong He" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">CV and my github webpage</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org23ed04a">1. How to update my website?</a></li>
<li><a href="#orgc49cdf7">2. Edit my cv</a>
<ul>
<li><a href="#org57e0988">2.1. Update publication list</a></li>
</ul>
</li>
<li><a href="#orgce08e04">3. Reminders</a></li>
<li><a href="#org9a6898d">4. Customization</a>
<ul>
<li><a href="#orga7c834a">4.1. What did I do?</a></li>
</ul>
</li>
<li><a href="#org6f17581">5. Publication</a>
<ul>
<li><a href="#orgc06346e">5.1. How to add a citation to my own publication?</a></li>
<li><a href="#orgf63179f">5.2. Add abstract to Publication (Do not use)</a></li>
</ul>
</li>
<li><a href="#orgd85ad54">6. Posts</a></li>
<li><a href="#org53daeb3">7. Color design</a></li>
<li><a href="#org6082c20">8. Future</a></li>
</ul>
</div>
</div>

<div id="outline-container-org23ed04a" class="outline-2">
<h2 id="org23ed04a"><span class="section-number-2">1</span> How to update my website?</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>Edit, and preview with <code>./view</code> in the website root folder.</li>
<li>Close the preview.</li>
<li><code>gitall</code> to sync the whole directory to github.</li>
<li><code>hugo</code> in the root folder to build the website and create html files
in <code>public</code>.</li>
<li><code>cd public</code> and <code>gitall</code> to sync html files to
<code>chongchonghe.github.io</code>. Done!</li>
</ol>
</div>
</div>

<div id="outline-container-orgc49cdf7" class="outline-2">
<h2 id="orgc49cdf7"><span class="section-number-2">2</span> Edit my cv</h2>
<div class="outline-text-2" id="text-2">
<p>
My cv is located at website/static/files/cv
</p>
</div>
<div id="outline-container-org57e0988" class="outline-3">
<h3 id="org57e0988"><span class="section-number-3">2.1</span> Update publication list</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>From bibdesk, use Edit -&gt; Copy As -&gt; Template -&gt; Harvard&#x2026;, and
paste to cv.tex. Do the following modification
<ul class="org-ul">
<li>Bold my name</li>
<li>Fix &amp; symble, if any</li>
<li>Rename journal name</li>
</ul></li>
<li>Compile and update site</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgce08e04" class="outline-2">
<h2 id="orgce08e04"><span class="section-number-2">3</span> Reminders</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Bibliography is located at <code>content/author/admin/_index.md</code>.</li>
<li>Contact form is located at <code>config/_default/params.toml</code>.</li>
<li>To write posts with org-mode and export to markdown, you may want
to use <a href="https://github.com/kaushalmodi/ox-hugo">ox-hugo</a>. Read
<a href="https://www.zcl.space/tools/my-blog-workflow/">https://www.zcl.space/tools/my-blog-workflow/</a>.</li>
<li>I use <a href="https://chongchonghe.disqus.com/admin/install/settings/">disqus</a> to enable comments to my website (currently disabled).</li>
</ul>
</div>
</div>

<div id="outline-container-org9a6898d" class="outline-2">
<h2 id="org9a6898d"><span class="section-number-2">4</span> Customization</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orga7c834a" class="outline-3">
<h3 id="orga7c834a"><span class="section-number-3">4.1</span> What did I do?</h3>
<div class="outline-text-3" id="text-4-1">
<dl class="org-dl">
<dt>Color theme</dt><dd><code>data/themes/custom.toml</code>, copied and modified from
<code>themes/academic/data/themes/default.toml</code>. Changed
the color of the background, menu, and hyperlinks
for the light mode.</dd>
<dt>Font color</dt><dd>Created <code>assets/css/custom.css</code>, copied and
modified from
<code>themes/academic/layouts/partials/css/academic.css</code>: set font color to
(0, 0, 0, 0.9). Set <code>plugins_css = ["custom"]</code> in
<code>config/_default/params.toml</code>. Reference:</dd>
</dl>
<p>
<a href="https://sourcethemes.com/academic/docs/customization/#customize-style-css">https://sourcethemes.com/academic/docs/customization/#customize-style-css</a>
     <a href="https://github.com/gcushen/hugo-academic/issues/126">https://github.com/gcushen/hugo-academic/issues/126</a>
</p>
<dl class="org-dl">
<dt>Font</dt><dd>have <code>/data/fonts/custom.toml</code> but did not change it nor
activate it.</dd>
</dl>
</div>
</div>
</div>

<div id="outline-container-org6f17581" class="outline-2">
<h2 id="org6f17581"><span class="section-number-2">5</span> Publication</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgc06346e" class="outline-3">
<h3 id="orgc06346e"><span class="section-number-3">5.1</span> How to add a citation to my own publication?</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Reference: <a href="https://sourcethemes.com/academic/docs/managing-content/#create-a-publication">https://sourcethemes.com/academic/docs/managing-content/#create-a-publication</a>
</p>

<dl class="org-dl">
<dt>Add bib entry</dt><dd>Add a bib entry to ./MyPublications.bib. Use "Last Name: year
format", e.g. He:2016, as the cite key. Remove the
abstract if it exists.</dd>

<dt>Export to hugo</dt><dd>In the root directory, do</dd>
</dl>

<div class="org-src-container">
<pre class="src src-bash">academic import --bibtex MyPublications.bib
</pre>
</div>

<p>
and the folders with new citations will be added to
<code>content/publications/</code>.
</p>

<p>
Reference: <a href="https://pypi.org/project/academic/">https://pypi.org/project/academic/</a>
</p>

<dl class="org-dl">
<dt>Remove <code>cite</code></dt><dd>Go to the publication folder and remove the .bib
file.</dd>

<dt>Add ADS/arxiv link</dt><dd>Do the following editing to index.md:
<ul class="org-ul">
<li><p>
Add the following line:
</p>
<div class="org-src-container">
<pre class="src src-markdown"><span style="color: #83a598;">links </span><span style="color: #7c6f64;">= </span><span style="color: #b8bb26;">[{name = "ads", url = "url"}]</span>
</pre>
</div></li>
<li>If you only have arxiv link, add <code>url_preprint = ""</code>.</li>
<li>If has math, add <code>math = true</code></li>
<li>Highlight my name by adding <code>**</code> around my name.</li>
</ul></dd>

<dt>(Optional) Abstract or intro</dt><dd>Copy the Abstract to the bottom of
index.md, or write a short paragraph. Latex works as is here.</dd>

<dt>(Optional) Feature image</dt><dd>Refer to he-2016/index.md. May need to
crop or extrapolate the image and save it as .jpg/png.

<ul class="org-ul">
<li>Use GIMP: Import pdf to GIMP, select the dpi (300 or 400), and save as jpg.</li>
</ul></dd>
</dl>
</div>
</div>

<div id="outline-container-orgf63179f" class="outline-3">
<h3 id="orgf63179f"><span class="section-number-3">5.2</span> Add abstract to Publication (Do not use)</h3>
<div class="outline-text-3" id="text-5-2">
<p>
In order to use LaTeX in the html abstract, you need to make the
following changes to the abstract entry in index.md:
</p>
<ul class="org-ul">
<li>Replace <code>\rm</code> <code>\it</code> with <code>\textrm{}</code> <code>\textit{}</code>, or remove them</li>
<li>Replace <code>~</code> with space</li>
<li>Replace <code>*</code> (e.g. in <code>M_*</code>) with <code>\star</code></li>
<li>In some places, need to add <code>\\</code> in front of <code>&gt;</code></li>
<li>Escape <code>\</code> with another <code>\</code> in front</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgd85ad54" class="outline-2">
<h2 id="orgd85ad54"><span class="section-number-2">6</span> Posts</h2>
<div class="outline-text-2" id="text-6">
<p>
I use posts to write my research description. 
</p>

<dl class="org-dl">
<dt>Create a post</dt><dd>To create a blog/news article, in the website folder:</dd>
</dl>
<div class="org-src-container">
<pre class="src src-bash">hugo new --kind post post/my-article-name
</pre>
</div>
<p>
Then edit content/post/my-article-name.md.
</p>

<dl class="org-dl">
<dt>Comments</dt><dd>To disable commenting for a specific post, you can add
<code>disable_comments =</code> true to the post <code>+++</code> preamble. Or
to disable commenting for all posts, you can either set
<code>disqusShortname = ""</code> (working) or <code>disable_comments = true</code> in
<code>config.toml</code> (not working).</dd>
</dl>
</div>
</div>

<div id="outline-container-org53daeb3" class="outline-2">
<h2 id="org53daeb3"><span class="section-number-2">7</span> Color design</h2>
<div class="outline-text-2" id="text-7">
<p>
See <code>color_scheme.html</code>.
</p>
</div>
</div>

<div id="outline-container-org6082c20" class="outline-2">
<h2 id="org6082c20"><span class="section-number-2">8</span> Future</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li>Could change to Hugo <a href="https://themes.gohugo.io/hugo-resume/">Resume theme</a> in the future, when the
webpage becomes long.</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: ChongChong He</p>
<p class="date">Created: 2019-12-23 Mon 15:30</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
